{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source": {
						"Text": "UnLua Editor"
					},
					"Translation": {
						"Text": "UnLua Editor"
					},
					"Key": "UnLuaEditor"
				}
			]
		},
		{
			"Namespace": "FUnLuaEditorModule",
			"Children": [
				{
					"Source": {
						"Text": "Bind"
					},
					"Translation": {
						"Text": "Bind"
					},
					"Key": "Bind"
				},
				{
					"Source": {
						"Text": "Copy as Relative Path"
					},
					"Translation": {
						"Text": "Copy as Relative Path"
					},
					"Key": "CopyAsRelativePath"
				},
				{
					"Source": {
						"Text": "Create Lua Template"
					},
					"Translation": {
						"Text": "Create Lua Template"
					},
					"Key": "CreateLuaTemplate"
				},
				{
					"Source": {
						"Text": "Lua file ({0}) is already existed!"
					},
					"Translation": {
						"Text": "Lua file ({0}) is already existed!"
					},
					"Key": "FileAlreadyExists"
				},
				{
					"Source": {
						"Text": "Please specify a module name first"
					},
					"Translation": {
						"Text": "Please specify a module name first"
					},
					"Key": "ModuleNameRequired"
				},
				{
					"Source": {
						"Text": "Reveal in Explorer"
					},
					"Translation": {
						"Text": "Reveal in Explorer"
					},
					"Key": "RevealInExplorer"
				},
				{
					"Source": {
						"Text": "The file does not exist."
					},
					"Translation": {
						"Text": "The file does not exist."
					},
					"Key": "FileNotExist"
				},
				{
					"Source": {
						"Text": "UnLua"
					},
					"Translation": {
						"Text": "UnLua"
					},
					"Key": "UnLua_Label"
				},
				{
					"Source": {
						"Text": "UnLua"
					},
					"Translation": {
						"Text": "UnLua"
					},
					"Key": "UnLua_ToolTip"
				},
				{
					"Source": {
						"Text": "UnLua Editor"
					},
					"Translation": {
						"Text": "UnLua Editor"
					},
					"Key": "UnLuaEditorSettingsName"
				},
				{
					"Source": {
						"Text": "UnLua Editor Settings"
					},
					"Translation": {
						"Text": "UnLua Editor Settings"
					},
					"Key": "UnLuaEditorSettingsDescription"
				},
				{
					"Source": {
						"Text": "Unbind"
					},
					"Translation": {
						"Text": "Unbind"
					},
					"Key": "Unbind"
				}
			]
		},
		{
			"Namespace": "FUnLuaModule",
			"Children": [
				{
					"Source": {
						"Text": "UnLua"
					},
					"Translation": {
						"Text": "UnLua"
					},
					"Key": "UnLuaEditorSettingsName"
				},
				{
					"Source": {
						"Text": "UnLua Runtime Settings"
					},
					"Translation": {
						"Text": "UnLua Runtime Settings"
					},
					"Key": "UnLuaEditorSettingsDescription"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "FUnLuaEditorCommands",
					"Children": [
						{
							"Source": {
								"Text": "About"
							},
							"Translation": {
								"Text": "About"
							},
							"Key": "About"
						},
						{
							"Source": {
								"Text": "About this version"
							},
							"Translation": {
								"Text": "About this version"
							},
							"Key": "About_ToolTip"
						},
						{
							"Source": {
								"Text": "Bind"
							},
							"Translation": {
								"Text": "Bind"
							},
							"Key": "BindToLua"
						},
						{
							"Source": {
								"Text": "Copy as Relative Path"
							},
							"Translation": {
								"Text": "Copy as Relative Path"
							},
							"Key": "CopyAsRelativePath"
						},
						{
							"Source": {
								"Text": "Copy module name as relative path."
							},
							"Translation": {
								"Text": "Copy module name as relative path."
							},
							"Key": "CopyAsRelativePath_ToolTip"
						},
						{
							"Source": {
								"Text": "Create Lua Template"
							},
							"Translation": {
								"Text": "Create Lua Template"
							},
							"Key": "CreateLuaTemplate"
						},
						{
							"Source": {
								"Text": "Create an issue on github"
							},
							"Translation": {
								"Text": "Create an issue on github"
							},
							"Key": "ReportIssue_ToolTip"
						},
						{
							"Source": {
								"Text": "Create lua template file"
							},
							"Translation": {
								"Text": "Create lua template file"
							},
							"Key": "CreateLuaTemplate_ToolTip"
						},
						{
							"Source": {
								"Text": "Generate IntelliSense"
							},
							"Translation": {
								"Text": "Generate IntelliSense"
							},
							"Key": "GenerateIntelliSense"
						},
						{
							"Source": {
								"Text": "Generate intelliSense files"
							},
							"Translation": {
								"Text": "Generate intelliSense files"
							},
							"Key": "GenerateIntelliSense_ToolTip"
						},
						{
							"Source": {
								"Text": "Hot Reload"
							},
							"Translation": {
								"Text": "Hot Reload"
							},
							"Key": "HotReload"
						},
						{
							"Source": {
								"Text": "Hot reload all lua states"
							},
							"Translation": {
								"Text": "Hot reload all lua states"
							},
							"Key": "HotReload_ToolTip"
						},
						{
							"Source": {
								"Text": "Implement UnLuaInterface"
							},
							"Translation": {
								"Text": "Implement UnLuaInterface"
							},
							"Key": "BindToLua_ToolTip"
						},
						{
							"Source": {
								"Text": "Open Editor Settings"
							},
							"Translation": {
								"Text": "Open Editor Settings"
							},
							"Key": "OpenEditorSettings"
						},
						{
							"Source": {
								"Text": "Open Runtime Settings"
							},
							"Translation": {
								"Text": "Open Runtime Settings"
							},
							"Key": "OpenRuntimeSettings"
						},
						{
							"Source": {
								"Text": "Open UnLua Editor settings"
							},
							"Translation": {
								"Text": "Open UnLua Editor settings"
							},
							"Key": "OpenEditorSettings_ToolTip"
						},
						{
							"Source": {
								"Text": "Open UnLua Runtime settings"
							},
							"Translation": {
								"Text": "Open UnLua Runtime settings"
							},
							"Key": "OpenRuntimeSettings_ToolTip"
						},
						{
							"Source": {
								"Text": "Remove the implementation of UnLuaInterface"
							},
							"Translation": {
								"Text": "Remove the implementation of UnLuaInterface"
							},
							"Key": "UnbindFromLua_ToolTip"
						},
						{
							"Source": {
								"Text": "Report issue"
							},
							"Translation": {
								"Text": "Report issue"
							},
							"Key": "ReportIssue"
						},
						{
							"Source": {
								"Text": "Reveal in Explorer"
							},
							"Translation": {
								"Text": "Reveal in Explorer"
							},
							"Key": "RevealInExplorer"
						},
						{
							"Source": {
								"Text": "Reveal lua file in explorer"
							},
							"Translation": {
								"Text": "Reveal lua file in explorer"
							},
							"Key": "RevealInExplorer_ToolTip"
						},
						{
							"Source": {
								"Text": "Unbind"
							},
							"Translation": {
								"Text": "Unbind"
							},
							"Key": "UnbindFromLua"
						}
					]
				}
			]
		},
		{
			"Namespace": "UnLuaAboutScreen",
			"Children": [
				{
					"Source": {
						"Text": "Close"
					},
					"Translation": {
						"Text": "Close"
					},
					"Key": "Close"
				},
				{
					"Source": {
						"Text": "Copyright (C) 2019 Tencent. All rights reserved."
					},
					"Translation": {
						"Text": "Copyright (C) 2019 Tencent. All rights reserved."
					},
					"Key": "Copyright3"
				},
				{
					"Source": {
						"Text": "Tencent is pleased to support the open source community by making UnLua available."
					},
					"Translation": {
						"Text": "Tencent is pleased to support the open source community by making UnLua available."
					},
					"Key": "Copyright2"
				},
				{
					"Source": {
						"Text": "Version: {0}"
					},
					"Translation": {
						"Text": "Version: {0}"
					},
					"Key": "VersionLabel"
				},
				{
					"Source": {
						"Text": "https://github.com/Tencent/UnLua"
					},
					"Translation": {
						"Text": "https://github.com/Tencent/UnLua"
					},
					"Key": "Copyright1"
				}
			]
		},
		{
			"Namespace": "UnLuaConsoleCommands",
			"Children": [
				{
					"Source": {
						"Text": "Force collect garbage in lua env."
					},
					"Translation": {
						"Text": "Force collect garbage in lua env."
					},
					"Key": "CommandText_CollectGarbage"
				},
				{
					"Source": {
						"Text": "Runs the given module path in lua env."
					},
					"Translation": {
						"Text": "Runs the given module path in lua env."
					},
					"Key": "CommandText_DoFile"
				},
				{
					"Source": {
						"Text": "Runs the given string in lua env."
					},
					"Translation": {
						"Text": "Runs the given string in lua env."
					},
					"Key": "CommandText_Do"
				}
			]
		},
		{
			"Namespace": "UnLuaIntelliSenseGenerator",
			"Children": [
				{
					"Source": {
						"Text": "Generating Blueprints IntelliSense"
					},
					"Translation": {
						"Text": "Generating Blueprints IntelliSense"
					},
					"Key": "GeneratingBlueprintsIntelliSense"
				}
			]
		},
		{
			"Namespace": "UnLuaMainMenuToolbar",
			"Children": [
				{
					"Source": {
						"Text": "About"
					},
					"Translation": {
						"Text": "About"
					},
					"Key": "About"
				},
				{
					"Source": {
						"Text": "About UnLua"
					},
					"Translation": {
						"Text": "About UnLua"
					},
					"Key": "AboutUnLua"
				},
				{
					"Source": {
						"Text": "Action"
					},
					"Translation": {
						"Text": "Action"
					},
					"Key": "Section_Action"
				},
				{
					"Source": {
						"Text": "Editor"
					},
					"Translation": {
						"Text": "Editor"
					},
					"Key": "OpenEditorSettings"
				},
				{
					"Source": {
						"Text": "Generate IntelliSense"
					},
					"Translation": {
						"Text": "Generate IntelliSense"
					},
					"Key": "GenerateIntelliSense"
				},
				{
					"Source": {
						"Text": "Help"
					},
					"Translation": {
						"Text": "Help"
					},
					"Key": "Section_Help"
				},
				{
					"Source": {
						"Text": "Hot Reload"
					},
					"Translation": {
						"Text": "Hot Reload"
					},
					"Key": "HotReload"
				},
				{
					"Source": {
						"Text": "Report Issue"
					},
					"Translation": {
						"Text": "Report Issue"
					},
					"Key": "ReportIssue"
				},
				{
					"Source": {
						"Text": "Runtime"
					},
					"Translation": {
						"Text": "Runtime"
					},
					"Key": "OpenRuntimeSettings"
				},
				{
					"Source": {
						"Text": "Settings"
					},
					"Translation": {
						"Text": "Settings"
					},
					"Key": "Section_SettingsMenu"
				},
				{
					"Source": {
						"Text": "UnLua"
					},
					"Translation": {
						"Text": "UnLua"
					},
					"Key": "UnLua_Label"
				},
				{
					"Source": {
						"Text": "UnLua"
					},
					"Translation": {
						"Text": "UnLua"
					},
					"Key": "UnLua_ToolTip"
				},
				{
					"Source": {
						"Text": "UnLua Settings"
					},
					"Translation": {
						"Text": "UnLua Settings"
					},
					"Key": "Section_SettingsMenu_ToolTip"
				}
			]
		},
		{
			"Namespace": "UObjectCategory",
			"Children": [
				{
					"Source": {
						"Text": "Build"
					},
					"Translation": {
						"Text": "Build"
					},
					"Key": "UnLuaEditorSettings:bAutoStartup"
				},
				{
					"Source": {
						"Text": "Build"
					},
					"Translation": {
						"Text": "Build"
					},
					"Key": "UnLuaEditorSettings:bEnableCallOverriddenFunction"
				},
				{
					"Source": {
						"Text": "Build"
					},
					"Translation": {
						"Text": "Build"
					},
					"Key": "UnLuaEditorSettings:bEnableDebug"
				},
				{
					"Source": {
						"Text": "Build"
					},
					"Translation": {
						"Text": "Build"
					},
					"Key": "UnLuaEditorSettings:bEnablePersistentParamBuffer"
				},
				{
					"Source": {
						"Text": "Build"
					},
					"Translation": {
						"Text": "Build"
					},
					"Key": "UnLuaEditorSettings:bEnableRPCCall"
				},
				{
					"Source": {
						"Text": "Build"
					},
					"Translation": {
						"Text": "Build"
					},
					"Key": "UnLuaEditorSettings:bEnableTypeChecking"
				},
				{
					"Source": {
						"Text": "Build"
					},
					"Translation": {
						"Text": "Build"
					},
					"Key": "UnLuaEditorSettings:bLuaCompileAsCpp"
				},
				{
					"Source": {
						"Text": "Coding"
					},
					"Translation": {
						"Text": "Coding"
					},
					"Key": "UnLuaEditorSettings:HotReloadMode"
				},
				{
					"Source": {
						"Text": "Coding"
					},
					"Translation": {
						"Text": "Coding"
					},
					"Key": "UnLuaEditorSettings:bGenerateIntelliSense"
				},
				{
					"Source": {
						"Text": "Legacy"
					},
					"Translation": {
						"Text": "Legacy"
					},
					"Key": "UnLuaEditorSettings:bLegacyAllowUTF8WithBOM"
				},
				{
					"Source": {
						"Text": "Legacy"
					},
					"Translation": {
						"Text": "Legacy"
					},
					"Key": "UnLuaEditorSettings:bLegacyBlueprintPath"
				},
				{
					"Source": {
						"Text": "Legacy"
					},
					"Translation": {
						"Text": "Legacy"
					},
					"Key": "UnLuaEditorSettings:bLegacyReturnOrder"
				},
				{
					"Source": {
						"Text": "Legacy"
					},
					"Translation": {
						"Text": "Legacy"
					},
					"Key": "UnLuaEditorSettings:bWithUE4Namespace"
				},
				{
					"Source": {
						"Text": "Runtime"
					},
					"Translation": {
						"Text": "Runtime"
					},
					"Key": "UnLuaSettings:StartupModuleName"
				},
				{
					"Source": {
						"Text": "Runtime"
					},
					"Translation": {
						"Text": "Runtime"
					},
					"Key": "UnLuaSettings:DeadLoopCheck"
				},
				{
					"Source": {
						"Text": "Runtime"
					},
					"Translation": {
						"Text": "Runtime"
					},
					"Key": "UnLuaSettings:EnvLocatorClass"
				},
				{
					"Source": {
						"Text": "Runtime"
					},
					"Translation": {
						"Text": "Runtime"
					},
					"Key": "UnLuaSettings:ModuleLocatorClass"
				},
				{
					"Source": {
						"Text": "Runtime"
					},
					"Translation": {
						"Text": "Runtime"
					},
					"Key": "UnLuaSettings:PreBindClasses"
				},
				{
					"Source": {
						"Text": "System"
					},
					"Translation": {
						"Text": "System"
					},
					"Key": "UnLuaEditorSettings:UpdateMode"
				}
			]
		},
		{
			"Namespace": "UObjectDisplayNames",
			"Children": [
				{
					"Source": {
						"Text": "Auto"
					},
					"Translation": {
						"Text": "Auto"
					},
					"Key": "EHotReloadMode.Auto"
				},
				{
					"Source": {
						"Text": "Auto Startup"
					},
					"Translation": {
						"Text": "Auto Startup"
					},
					"Key": "UnLuaEditorSettings:bAutoStartup"
				},
				{
					"Source": {
						"Text": "Axis Value"
					},
					"Translation": {
						"Text": "Axis Value"
					},
					"Key": "UnLuaManager:InputAxis:AxisValue"
				},
				{
					"Source": {
						"Text": "Axis Value"
					},
					"Translation": {
						"Text": "Axis Value"
					},
					"Key": "UnLuaManager:InputVectorAxis:AxisValue"
				},
				{
					"Source": {
						"Text": "Binding Class"
					},
					"Translation": {
						"Text": "Binding Class"
					},
					"Key": "UnLuaManager:GetOrAddBindingObject:BindingClass"
				},
				{
					"Source": {
						"Text": "Callback"
					},
					"Translation": {
						"Text": "Callback"
					},
					"Key": "UnLuaLatentAction:Callback"
				},
				{
					"Source": {
						"Text": "Class"
					},
					"Translation": {
						"Text": "Class"
					},
					"Key": "UnLuaManager:GetOrAddBindingObject:Class"
				},
				{
					"Source": {
						"Text": "Class"
					},
					"Translation": {
						"Text": "Class"
					},
					"Key": "UnLuaManager:Override:Class"
				},
				{
					"Source": {
						"Text": "Dead Loop Check"
					},
					"Translation": {
						"Text": "Dead Loop Check"
					},
					"Key": "UnLuaSettings:DeadLoopCheck"
				},
				{
					"Source": {
						"Text": "Dummy"
					},
					"Translation": {
						"Text": "Dummy"
					},
					"Key": "LuaDelegateHandler:Dummy"
				},
				{
					"Source": {
						"Text": "EHot Reload Mode"
					},
					"Translation": {
						"Text": "EHot Reload Mode"
					},
					"Key": "EHotReloadMode"
				},
				{
					"Source": {
						"Text": "EHot Reload Mode MAX"
					},
					"Translation": {
						"Text": "EHot Reload Mode MAX"
					},
					"Key": "EHotReloadMode.EHotReloadMode_MAX"
				},
				{
					"Source": {
						"Text": "EUpdate Mode"
					},
					"Translation": {
						"Text": "EUpdate Mode"
					},
					"Key": "EUpdateMode"
				},
				{
					"Source": {
						"Text": "EUpdate Mode MAX"
					},
					"Translation": {
						"Text": "EUpdate Mode MAX"
					},
					"Key": "EUpdateMode.EUpdateMode_MAX"
				},
				{
					"Source": {
						"Text": "Enable Call Overridden Function"
					},
					"Translation": {
						"Text": "Enable Call Overridden Function"
					},
					"Key": "UnLuaEditorSettings:bEnableCallOverriddenFunction"
				},
				{
					"Source": {
						"Text": "Enable Debug"
					},
					"Translation": {
						"Text": "Enable Debug"
					},
					"Key": "UnLuaEditorSettings:bEnableDebug"
				},
				{
					"Source": {
						"Text": "Enable Persistent Param Buffer"
					},
					"Translation": {
						"Text": "Enable Persistent Param Buffer"
					},
					"Key": "UnLuaEditorSettings:bEnablePersistentParamBuffer"
				},
				{
					"Source": {
						"Text": "Enable RPCCall"
					},
					"Translation": {
						"Text": "Enable RPCCall"
					},
					"Key": "UnLuaEditorSettings:bEnableRPCCall"
				},
				{
					"Source": {
						"Text": "Enable Type Checking"
					},
					"Translation": {
						"Text": "Enable Type Checking"
					},
					"Key": "UnLuaEditorSettings:bEnableTypeChecking"
				},
				{
					"Source": {
						"Text": "Env Locator Class"
					},
					"Translation": {
						"Text": "Env Locator Class"
					},
					"Key": "UnLuaSettings:EnvLocatorClass"
				},
				{
					"Source": {
						"Text": "Finger Index"
					},
					"Translation": {
						"Text": "Finger Index"
					},
					"Key": "UnLuaManager:InputTouch:FingerIndex"
				},
				{
					"Source": {
						"Text": "Function Name"
					},
					"Translation": {
						"Text": "Function Name"
					},
					"Key": "UnLuaManager:Override:FunctionName"
				},
				{
					"Source": {
						"Text": "Generate Intelli Sense"
					},
					"Translation": {
						"Text": "Generate Intelli Sense"
					},
					"Key": "UnLuaEditorSettings:bGenerateIntelliSense"
				},
				{
					"Source": {
						"Text": "Get File Last Modified Timestamp"
					},
					"Translation": {
						"Text": "Get File Last Modified Timestamp"
					},
					"Key": "UnLuaFunctionLibrary:GetFileLastModifiedTimestamp"
				},
				{
					"Source": {
						"Text": "Get Module Name"
					},
					"Translation": {
						"Text": "Get Module Name"
					},
					"Key": "UnLuaInterface:GetModuleName"
				},
				{
					"Source": {
						"Text": "Get Script Root Path"
					},
					"Translation": {
						"Text": "Get Script Root Path"
					},
					"Key": "UnLuaFunctionLibrary:GetScriptRootPath"
				},
				{
					"Source": {
						"Text": "Get Tickable when Paused"
					},
					"Translation": {
						"Text": "Get Tickable when Paused"
					},
					"Key": "UnLuaLatentAction:GetTickableWhenPaused"
				},
				{
					"Source": {
						"Text": "Get or Add Binding Object"
					},
					"Translation": {
						"Text": "Get or Add Binding Object"
					},
					"Key": "UnLuaManager:GetOrAddBindingObject"
				},
				{
					"Source": {
						"Text": "Help Description"
					},
					"Translation": {
						"Text": "Help Description"
					},
					"Key": "Commandlet:HelpDescription"
				},
				{
					"Source": {
						"Text": "Help Param Descriptions"
					},
					"Translation": {
						"Text": "Help Param Descriptions"
					},
					"Key": "Commandlet:HelpParamDescriptions"
				},
				{
					"Source": {
						"Text": "Help Param Names"
					},
					"Translation": {
						"Text": "Help Param Names"
					},
					"Key": "Commandlet:HelpParamNames"
				},
				{
					"Source": {
						"Text": "Help Usage"
					},
					"Translation": {
						"Text": "Help Usage"
					},
					"Key": "Commandlet:HelpUsage"
				},
				{
					"Source": {
						"Text": "Help Web Link"
					},
					"Translation": {
						"Text": "Help Web Link"
					},
					"Key": "Commandlet:HelpWebLink"
				},
				{
					"Source": {
						"Text": "Hot Reload"
					},
					"Translation": {
						"Text": "Hot Reload"
					},
					"Key": "UnLuaFunctionLibrary:HotReload"
				},
				{
					"Source": {
						"Text": "Hot Reload Mode"
					},
					"Translation": {
						"Text": "Hot Reload Mode"
					},
					"Key": "UnLuaEditorSettings:HotReloadMode"
				},
				{
					"Source": {
						"Text": "In Linkage"
					},
					"Translation": {
						"Text": "In Linkage"
					},
					"Key": "UnLuaLatentAction:OnCompleted:InLinkage"
				},
				{
					"Source": {
						"Text": "In Linkage"
					},
					"Translation": {
						"Text": "In Linkage"
					},
					"Key": "UnLuaLatentAction:OnLegacyCallback:InLinkage"
				},
				{
					"Source": {
						"Text": "In Linkage"
					},
					"Translation": {
						"Text": "In Linkage"
					},
					"Key": "UnLuaLatentActionCallback__DelegateSignature:InLinkage"
				},
				{
					"Source": {
						"Text": "Input Action"
					},
					"Translation": {
						"Text": "Input Action"
					},
					"Key": "UnLuaManager:InputAction"
				},
				{
					"Source": {
						"Text": "Input Axis"
					},
					"Translation": {
						"Text": "Input Axis"
					},
					"Key": "UnLuaManager:InputAxis"
				},
				{
					"Source": {
						"Text": "Input Gesture"
					},
					"Translation": {
						"Text": "Input Gesture"
					},
					"Key": "UnLuaManager:InputGesture"
				},
				{
					"Source": {
						"Text": "Input Touch"
					},
					"Translation": {
						"Text": "Input Touch"
					},
					"Key": "UnLuaManager:InputTouch"
				},
				{
					"Source": {
						"Text": "Input Vector Axis"
					},
					"Translation": {
						"Text": "Input Vector Axis"
					},
					"Key": "UnLuaManager:InputVectorAxis"
				},
				{
					"Source": {
						"Text": "Is Client"
					},
					"Translation": {
						"Text": "Is Client"
					},
					"Key": "Commandlet:IsClient"
				},
				{
					"Source": {
						"Text": "Is Editor"
					},
					"Translation": {
						"Text": "Is Editor"
					},
					"Key": "Commandlet:IsEditor"
				},
				{
					"Source": {
						"Text": "Is Server"
					},
					"Translation": {
						"Text": "Is Server"
					},
					"Key": "Commandlet:IsServer"
				},
				{
					"Source": {
						"Text": "Key"
					},
					"Translation": {
						"Text": "Key"
					},
					"Key": "UnLuaManager:InputAction:Key"
				},
				{
					"Source": {
						"Text": "Legacy Allow UTF8With BOM"
					},
					"Translation": {
						"Text": "Legacy Allow UTF8With BOM"
					},
					"Key": "UnLuaEditorSettings:bLegacyAllowUTF8WithBOM"
				},
				{
					"Source": {
						"Text": "Legacy Blueprint Path"
					},
					"Translation": {
						"Text": "Legacy Blueprint Path"
					},
					"Key": "UnLuaEditorSettings:bLegacyBlueprintPath"
				},
				{
					"Source": {
						"Text": "Legacy Return Order"
					},
					"Translation": {
						"Text": "Legacy Return Order"
					},
					"Key": "UnLuaEditorSettings:bLegacyReturnOrder"
				},
				{
					"Source": {
						"Text": "Link ID"
					},
					"Translation": {
						"Text": "Link ID"
					},
					"Key": "UnLuaManager:OnLatentActionCompleted:LinkID"
				},
				{
					"Source": {
						"Text": "List of classes to bind on startup"
					},
					"Translation": {
						"Text": "List of classes to bind on startup"
					},
					"Key": "UnLuaSettings:PreBindClasses"
				},
				{
					"Source": {
						"Text": "Location"
					},
					"Translation": {
						"Text": "Location"
					},
					"Key": "UnLuaManager:InputTouch:Location"
				},
				{
					"Source": {
						"Text": "Log to Console"
					},
					"Translation": {
						"Text": "Log to Console"
					},
					"Key": "Commandlet:LogToConsole"
				},
				{
					"Source": {
						"Text": "Lua Compile as Cpp"
					},
					"Translation": {
						"Text": "Lua Compile as Cpp"
					},
					"Key": "UnLuaEditorSettings:bLuaCompileAsCpp"
				},
				{
					"Source": {
						"Text": "Lua Delegate Handler"
					},
					"Translation": {
						"Text": "Lua Delegate Handler"
					},
					"Key": "LuaDelegateHandler"
				},
				{
					"Source": {
						"Text": "Lua Env Locator"
					},
					"Translation": {
						"Text": "Lua Env Locator"
					},
					"Key": "LuaEnvLocator"
				},
				{
					"Source": {
						"Text": "Lua Env Locator by Game Instance"
					},
					"Translation": {
						"Text": "Lua Env Locator by Game Instance"
					},
					"Key": "LuaEnvLocator_ByGameInstance"
				},
				{
					"Source": {
						"Text": "Lua Function"
					},
					"Translation": {
						"Text": "Lua Function"
					},
					"Key": "LuaFunction"
				},
				{
					"Source": {
						"Text": "Lua Function Name"
					},
					"Translation": {
						"Text": "Lua Function Name"
					},
					"Key": "UnLuaManager:Override:LuaFunctionName"
				},
				{
					"Source": {
						"Text": "Lua Module Locator"
					},
					"Translation": {
						"Text": "Lua Module Locator"
					},
					"Key": "LuaModuleLocator"
				},
				{
					"Source": {
						"Text": "Lua Module Locator by Package"
					},
					"Translation": {
						"Text": "Lua Module Locator by Package"
					},
					"Key": "LuaModuleLocator_ByPackage"
				},
				{
					"Source": {
						"Text": "LuaModuleLocator"
					},
					"Translation": {
						"Text": "LuaModuleLocator"
					},
					"Key": "UnLuaSettings:ModuleLocatorClass"
				},
				{
					"Source": {
						"Text": "Manual"
					},
					"Translation": {
						"Text": "Manual"
					},
					"Key": "EHotReloadMode.Manual"
				},
				{
					"Source": {
						"Text": "Manual"
					},
					"Translation": {
						"Text": "Manual"
					},
					"Key": "EUpdateMode.Manual"
				},
				{
					"Source": {
						"Text": "Never"
					},
					"Translation": {
						"Text": "Never"
					},
					"Key": "EHotReloadMode.Never"
				},
				{
					"Source": {
						"Text": "None"
					},
					"Translation": {
						"Text": "None"
					},
					"Key": "EUpdateMode.None"
				},
				{
					"Source": {
						"Text": "On Completed"
					},
					"Translation": {
						"Text": "On Completed"
					},
					"Key": "UnLuaLatentAction:OnCompleted"
				},
				{
					"Source": {
						"Text": "On Latent Action Completed"
					},
					"Translation": {
						"Text": "On Latent Action Completed"
					},
					"Key": "UnLuaManager:OnLatentActionCompleted"
				},
				{
					"Source": {
						"Text": "On Legacy Callback"
					},
					"Translation": {
						"Text": "On Legacy Callback"
					},
					"Key": "UnLuaLatentAction:OnLegacyCallback"
				},
				{
					"Source": {
						"Text": "Override"
					},
					"Translation": {
						"Text": "Override"
					},
					"Key": "UnLuaManager:Override"
				},
				{
					"Source": {
						"Text": "Path"
					},
					"Translation": {
						"Text": "Path"
					},
					"Key": "UnLuaFunctionLibrary:GetFileLastModifiedTimestamp:Path"
				},
				{
					"Source": {
						"Text": "Property Collector"
					},
					"Translation": {
						"Text": "Property Collector"
					},
					"Key": "PropertyCollector"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "UnLuaFunctionLibrary:GetFileLastModifiedTimestamp:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "UnLuaFunctionLibrary:GetScriptRootPath:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "UnLuaInterface:GetModuleName:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "UnLuaLatentAction:GetTickableWhenPaused:ReturnValue"
				},
				{
					"Source": {
						"Text": "Return Value"
					},
					"Translation": {
						"Text": "Return Value"
					},
					"Key": "UnLuaManager:GetOrAddBindingObject:ReturnValue"
				},
				{
					"Source": {
						"Text": "Set Tickable when Paused"
					},
					"Translation": {
						"Text": "Set Tickable when Paused"
					},
					"Key": "UnLuaLatentAction:SetTickableWhenPaused"
				},
				{
					"Source": {
						"Text": "Show Error Count"
					},
					"Translation": {
						"Text": "Show Error Count"
					},
					"Key": "Commandlet:ShowErrorCount"
				},
				{
					"Source": {
						"Text": "Show Progress"
					},
					"Translation": {
						"Text": "Show Progress"
					},
					"Key": "Commandlet:ShowProgress"
				},
				{
					"Source": {
						"Text": "Start"
					},
					"Translation": {
						"Text": "Start"
					},
					"Key": "EUpdateMode.Start"
				},
				{
					"Source": {
						"Text": "Startup Module Name"
					},
					"Translation": {
						"Text": "Startup Module Name"
					},
					"Key": "UnLuaSettings:StartupModuleName"
				},
				{
					"Source": {
						"Text": "Tick Even when Paused"
					},
					"Translation": {
						"Text": "Tick Even when Paused"
					},
					"Key": "UnLuaLatentAction:bTickEvenWhenPaused"
				},
				{
					"Source": {
						"Text": "Tickable when Paused"
					},
					"Translation": {
						"Text": "Tickable when Paused"
					},
					"Key": "UnLuaLatentAction:SetTickableWhenPaused:bTickableWhenPaused"
				},
				{
					"Source": {
						"Text": "Trigger Anim Notify"
					},
					"Translation": {
						"Text": "Trigger Anim Notify"
					},
					"Key": "UnLuaManager:TriggerAnimNotify"
				},
				{
					"Source": {
						"Text": "Un Lua Editor Function Library"
					},
					"Translation": {
						"Text": "Un Lua Editor Function Library"
					},
					"Key": "UnLuaEditorFunctionLibrary"
				},
				{
					"Source": {
						"Text": "Un Lua Function Library"
					},
					"Translation": {
						"Text": "Un Lua Function Library"
					},
					"Key": "UnLuaFunctionLibrary"
				},
				{
					"Source": {
						"Text": "Un Lua Intelli Sense Commandlet"
					},
					"Translation": {
						"Text": "Un Lua Intelli Sense Commandlet"
					},
					"Key": "UnLuaIntelliSenseCommandlet"
				},
				{
					"Source": {
						"Text": "Un Lua Interface"
					},
					"Translation": {
						"Text": "Un Lua Interface"
					},
					"Key": "UnLuaInterface"
				},
				{
					"Source": {
						"Text": "Un Lua Latent Action"
					},
					"Translation": {
						"Text": "Un Lua Latent Action"
					},
					"Key": "UnLuaLatentAction"
				},
				{
					"Source": {
						"Text": "Un Lua Latent Action Callback  Delegate Signature"
					},
					"Translation": {
						"Text": "Un Lua Latent Action Callback  Delegate Signature"
					},
					"Key": "UnLuaLatentActionCallback__DelegateSignature"
				},
				{
					"Source": {
						"Text": "Un Lua Manager"
					},
					"Translation": {
						"Text": "Un Lua Manager"
					},
					"Key": "UnLuaManager"
				},
				{
					"Source": {
						"Text": "UnLua"
					},
					"Translation": {
						"Text": "UnLua"
					},
					"Key": "UnLuaSettings"
				},
				{
					"Source": {
						"Text": "UnLuaEditor"
					},
					"Translation": {
						"Text": "UnLuaEditor"
					},
					"Key": "UnLuaEditorSettings"
				},
				{
					"Source": {
						"Text": "Update Mode"
					},
					"Translation": {
						"Text": "Update Mode"
					},
					"Key": "UnLuaEditorSettings:UpdateMode"
				},
				{
					"Source": {
						"Text": "Value"
					},
					"Translation": {
						"Text": "Value"
					},
					"Key": "UnLuaManager:InputGesture:Value"
				},
				{
					"Source": {
						"Text": "With UE4Namespace"
					},
					"Translation": {
						"Text": "With UE4Namespace"
					},
					"Key": "UnLuaEditorSettings:bWithUE4Namespace"
				}
			]
		},
		{
			"Namespace": "UObjectToolTips",
			"Children": [
				{
					"Source": {
						"Text": "Allow lua file with UTF-8 BOM header. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Allow lua file with UTF-8 BOM header. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bLegacyAllowUTF8WithBOM"
				},
				{
					"Source": {
						"Text": "Auto append '_C' to blueprint class path. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Auto append '_C' to blueprint class path. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bLegacyBlueprintPath"
				},
				{
					"Source": {
						"Text": "Class of LuaEnvLocator, which handles lua env locating for each UObject."
					},
					"Translation": {
						"Text": "Class of LuaEnvLocator, which handles lua env locating for each UObject."
					},
					"Key": "UnLuaSettings:EnvLocatorClass"
				},
				{
					"Source": {
						"Text": "Create UE4 global table on lua env. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Create UE4 global table on lua env. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bWithUE4Namespace"
				},
				{
					"Source": {
						"Text": "Enable 'Overridden' support at lua runtime. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Enable 'Overridden' support at lua runtime. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bEnableCallOverriddenFunction"
				},
				{
					"Source": {
						"Text": "Enable RPC support (Deprecated). (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Enable RPC support (Deprecated). (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bEnableRPCCall"
				},
				{
					"Source": {
						"Text": "Enable UnLua debug routine codes. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Enable UnLua debug routine codes. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bEnableDebug"
				},
				{
					"Source": {
						"Text": "Enable persistent buffer for UFunction's parameters. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Enable persistent buffer for UFunction's parameters. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bEnablePersistentParamBuffer"
				},
				{
					"Source": {
						"Text": "Enable type checking at lua runtime. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Enable type checking at lua runtime. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bEnableTypeChecking"
				},
				{
					"Source": {
						"Text": "End Interface FTickableGameObject"
					},
					"Translation": {
						"Text": "End Interface FTickableGameObject"
					},
					"Key": "UnLuaLatentAction:OnLegacyCallback"
				},
				{
					"Source": {
						"Text": "Entry module name of lua env. Leave it empty to skip execution on startup."
					},
					"Translation": {
						"Text": "Entry module name of lua env. Leave it empty to skip execution on startup."
					},
					"Key": "UnLuaSettings:StartupModuleName"
				},
				{
					"Source": {
						"Text": "List of classes to bind on startup."
					},
					"Translation": {
						"Text": "List of classes to bind on startup."
					},
					"Key": "UnLuaSettings:PreBindClasses"
				},
				{
					"Source": {
						"Text": "Pick a method for lua hot-reload."
					},
					"Translation": {
						"Text": "Pick a method for lua hot-reload."
					},
					"Key": "UnLuaEditorSettings:HotReloadMode"
				},
				{
					"Source": {
						"Text": "Place out parameters before return value. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Place out parameters before return value. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bLegacyReturnOrder"
				},
				{
					"Source": {
						"Text": "Prevent from infinite loops in lua. Timeout in seconds."
					},
					"Translation": {
						"Text": "Prevent from infinite loops in lua. Timeout in seconds."
					},
					"Key": "UnLuaSettings:DeadLoopCheck"
				},
				{
					"Source": {
						"Text": "Whether or not compile lua module as c++ code. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Whether or not compile lua module as c++ code. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bLuaCompileAsCpp"
				},
				{
					"Source": {
						"Text": "Whether or not generate intellisense files for lua."
					},
					"Translation": {
						"Text": "Whether or not generate intellisense files for lua."
					},
					"Key": "UnLuaEditorSettings:bGenerateIntelliSense"
				},
				{
					"Source": {
						"Text": "Whether or not startup UnLua module on game start. (Requires restart to take effect)"
					},
					"Translation": {
						"Text": "Whether or not startup UnLua module on game start. (Requires restart to take effect)"
					},
					"Key": "UnLuaEditorSettings:bAutoStartup"
				},
				{
					"Source": {
						"Text": "return a Lua file path which is relative to project's 'Content/Script', for example 'Weapon.BP_DefaultProjectile_C'"
					},
					"Translation": {
						"Text": "return a Lua file path which is relative to project's 'Content/Script', for example 'Weapon.BP_DefaultProjectile_C'"
					},
					"Key": "UnLuaInterface:GetModuleName"
				}
			]
		}
	]
}